#+title: Sprint Backlog 05
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Mission

- Integrate VTK with CGAL
- Create a mesh wit CGAL

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75
#+CAPTION: Clock summary at [2016-01-25 Mon 21:36]
| <75>                                                                        |         |       |       |
| Headline                                                                    | Time    |       |       |
|-----------------------------------------------------------------------------+---------+-------+-------|
| *Total time*                                                                | *27:27* |       |       |
|-----------------------------------------------------------------------------+---------+-------+-------|
| Stories                                                                     | 27:27   |       |       |
| Active                                                                      |         | 27:27 |       |
| COMPLETED Sprint and product backlog grooming                               |         |       |  0:16 |
| COMPLETED Journal club and other activities                                 |         |       |  0:10 |
| COMPLETED Chat with btn                                                     |         |       |  0:41 |
| COMPLETED Get Qt5/VTK6 code to build                                        |         |       |  2:57 |
| COMPLETED Setup new PC                                                      |         |       | 10:10 |
| COMPLETED Sort out monitoring form                                          |         |       |  1:23 |
| COMPLETED Create a geometric representation of ball and stick               |         |       |  7:51 |
| CANCELLED Create a VTK setup from github                                    |         |       |  3:59 |
#+end:

*** COMPLETED Sprint and product backlog grooming                     :story:
    CLOSED: [2016-01-18 Mon 14:11]
    CLOCK: [2016-01-04 Mon 17:19]--[2016-01-04 Mon 17:35] =>  0:16

Updates to sprint and product backlog.

*** COMPLETED Journal club and other activities                       :story:
    CLOSED: [2016-01-18 Mon 14:11]
    CLOCK: [2016-01-06 Wed 16:34]--[2016-01-06 Wed 16:44] =>  0:10

Time spent in generic tasks.

*** COMPLETED Chat with btn                                           :story:
    CLOSED: [2016-01-06 Wed 16:46]
    CLOCK: [2016-01-06 Wed 15:53]--[2016-01-06 Wed 16:34] =>  0:41

- update on VTK progress
- a couple of suggestions on work to try out.

*** COMPLETED Add support for VTK                                     :story:
    CLOSED: [2016-01-06 Wed 16:49]

We need to get a simple VTK example to compile and run, adding all the
required infrastructure (debian packages, CMake files, etc).

We should create a very simple Qt gui.

*** COMPLETED Get Qt5/VTK6 code to build                              :story:
    CLOSED: [2016-01-06 Wed 16:45]
    CLOCK: [2016-01-05 Tue 17:09]--[2016-01-05 Tue 18:15] =>  1:06
    CLOCK: [2016-01-05 Tue 16:51]--[2016-01-05 Tue 17:08] =>  0:17
    CLOCK: [2016-01-05 Tue 16:34]--[2016-01-05 Tue 16:50] =>  0:16
    CLOCK: [2016-01-05 Tue 15:15]--[2016-01-05 Tue 16:33] =>  1:18

As debian testing now has Qt5 and VTK 6.2, we don't need to build from
source any more. Use the packages to get soma to build and run.

*** COMPLETED Setup new PC                                            :story:
    CLOSED: [2016-01-11 Mon 15:29]
    CLOCK: [2016-01-15 Fri 15:02]--[2016-01-15 Fri 15:30] =>  0:28
    CLOCK: [2016-01-13 Wed 14:20]--[2016-01-13 Wed 15:30] =>  1:10
    CLOCK: [2016-01-12 Tue 14:20]--[2016-01-12 Tue 16:10] =>  1:50
    CLOCK: [2016-01-11 Mon 16:02]--[2016-01-11 Mon 18:02] =>  2:00
    CLOCK: [2016-01-11 Mon 15:30]--[2016-01-11 Mon 16:01] =>  0:31
    CLOCK: [2016-01-11 Mon 13:50]--[2016-01-11 Mon 15:28] =>  1:38
    CLOCK: [2016-01-08 Fri 14:27]--[2016-01-08 Fri 17:00] =>  2:33

We need to install debian and setup the new box.

Notes:

- problems with NTP. Use systemd according to [[https://wiki.archlinux.org/index.php/systemd-timesyncd][this]] page. However we
  still have problems and cannot connect any of the servers in the
  debian pool. Leave it like this for now.

*** COMPLETED Sort out monitoring form                                :story:
    CLOSED: [2016-01-13 Wed 16:12]
    CLOCK: [2016-01-15 Fri 14:20]--[2016-01-15 Fri 15:01] =>  0:41
    CLOCK: [2016-01-13 Wed 15:30]--[2016-01-13 Wed 16:12] =>  0:42

Get all sigs and give it to reception.

*** COMPLETED Create a geometric representation of ball and stick     :story:
    CLOSED: [2016-01-18 Mon 14:07]
    CLOCK: [2016-01-15 Fri 15:31]--[2016-01-15 Fri 16:01] =>  0:30
    CLOCK: [2016-01-13 Wed 15:31]--[2016-01-13 Wed 17:59] =>  2:28
    CLOCK: [2016-01-12 Tue 16:10]--[2016-01-12 Tue 18:01] =>  1:51
    CLOCK: [2016-01-06 Wed 16:45]--[2016-01-06 Wed 17:58] =>  1:13
    CLOCK: [2016-01-06 Wed 14:32]--[2016-01-06 Wed 16:21] =>  1:49

Using VTK, draw the simple SWC file.

*** CANCELLED Create a VTK setup from github                          :story:
    CLOSED: [2016-01-05 Tue 16:35]
    CLOCK: [2016-01-04 Mon 17:35]--[2016-01-04 Mon 21:34] =>  3:59

*Rationale*: Recent'ish packages have hit testing so no need to use
the source, luke.

It seems the debian packages are a bit outdated. Build from source.

- [[http://www.vtk.org/Wiki/VTK/Building/Linux][VTK/Building/Linux]]
- [[http://www.vtk.org/Wiki/VTK/Tutorials/QtSetup][VTK/Tutorials/QtSetup]]
- [[https://www.youtube.com/watch?v%3Dsb5FTVGqhPo][Building Qt-enabled VTK applications]]
- [[http://mitk.org/wiki/MITK][The Medical Imaging Interaction Toolkit (MITK)]]
- [[http://docs.mitk.org/2015.05/Architecture.html][MITK Artchitecture]]
- [[http://www.commontk.org/index.php/Main_Page][CTK - The Common Toolkit]]

: sudo apt-get install qtbase5-dev qttools5-dev
: git clone git@github.com:Kitware/VTK.git
: cd VTK
: mkdir build
: cd build
: CMAKE_INCLUDE_PATH=/usr/local/personal/include CMAKE_LIBRARY_PATH=/usr/local/personal/lib cmake -DCMAKE_INSTALL_PREFIX=/home/marco/Development/phd/local -DVTK_QT_VERSION:STRING=5 -DVTK_Group_Qt:BOOL=ON -DBUILD_SHARED_LIBS:BOOL=ON -G Ninja ..
: cd ~/Development/phd/neurite/build/output/gcc-5/ && CMAKE_INCLUDE_PATH=/usr/local/personal/include:/home/marco/Development/phd/local/include CMAKE_LIBRARY_PATH=/usr/local/personal/lib:/home/marco/Development/phd/local/lib CC=gcc-5 CXX=g++-5 CMAKE_PROGRAM_PATH=/home/marco/Development/DomainDrivenConsulting/dogen/build/output/gcc-5/stage/bin VTK_DIR=/home/marco/Development/phd/local/lib/cmake/vtk-6.3/ cmake -DVERBOSE=1 -DCMAKE_EXPORT_COMPILE_COMMANDS=ON ../../../ -G Ninja && ninja -j2 soma
: cmake -DVTK_QT_VERSION:STRING=5 -DVTK_Group_Qt:BOOL=ON -DBUILD_SHARED_LIBS:BOOL=ON -G Ninja ..

** Deprecated
